In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/abhishek/.local/lib/python3.8/site-packages (1.3.2)
Requirement already satisfied: pytz>=2017.3 in /usr/lib/python3/dist-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/lib/python3/dist-packages (from pandas) (2.7.3)
Requirement already satisfied: numpy>=1.17.3 in /home/abhishek/.local/lib/python3.8/site-packages (from pandas) (1.21.0)

In [2]:
!pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in /home/abhishek/.local/lib/python3.8/site-packages (2.0.1)

In [3]:
import pandas as pd
import numpy as np
import xlrd

**1> Write a program to add, subtract, multiple and divide two Pandas series.**

In [4]:
series1 = pd.Series([3,4,6,5,9])
series2 = pd.Series([1,2,9,5,6])

In [5]:
series3 = series1 + series2
series3

0     4
1     6
2    15
3    10
4    15
dtype: int64

In [6]:
series4 = series1 - series2
series4

0    2
1    2
2   -3
3    0
4    3
dtype: int64

In [7]:
series5 = series1 * series2
series5

0     3
1     8
2    54
3    25
4    54
dtype: int64

In [8]:
series6 = series1 / series2
series6

0    3.000000
1    2.000000
2    0.666667
3    1.000000
4    1.500000
dtype: float64

**2> Write a program to convert a dictionary to a Pandas series.**

In [9]:
dict1 = {'name': 'Abhishek', 'enroll': 19, 'course': 'Computer'}
dseries = pd.Series(dict1)
dseries

name      Abhishek
enroll          19
course    Computer
dtype: object

**3> Write a program to convert a NumPy array to a Pandas series and a series to an array.**

In [10]:
np_arr = np.array([2,4,6,8,10])
print(f'Numpy array = {np_arr}')

ser = pd.Series(np_arr)
print(f'\nConverted to pandas series =\n{ser}')

Numpy array = [ 2  4  6  8 10]

Converted to pandas series =
0     2
1     4
2     6
3     8
4    10
dtype: int64

In [11]:
# converting the series ser back to numpy array
np_arr1 = ser.to_numpy()

print(np_arr1)
print(type(np_arr1))

[ 2  4  6  8 10]
<class 'numpy.ndarray'>

**4> Write a program to add some data to an existing series.**

In [12]:
ser1 = pd.Series([2,3,6,7])
ser2 = pd.Series([9,11,13,89])
ser1 = ser1.append(ser2)
ser1

0     2
1     3
2     6
3     7
0     9
1    11
2    13
3    89
dtype: int64

**5> Write a program to calculate the frequency counts of each 
unique value of a given series**

In [13]:
sample = pd.Series([3,3,8,9,5,8,2,9,9,3,4,7,2])
sample.value_counts()

3    3
9    3
8    2
2    2
5    1
4    1
7    1
dtype: int64

**6> Write a program to create and display a DataFrame from a specified dictionary data
which has the index labels. 
<br>Get and print first 3 rows of the DataFrame.**

In [14]:
data = {
    'name': ['Abhishek', 'Elon', 'Steve', 'Mark', 'Jeff', 'Roger', 'Jha'],
    'score': [20, 18, 10, np.nan, 17, np.nan, 19],
    'attempts': [1, 1, 2, 2, 1, 3, 1],
    'qualify': ['Yes', 'Yes', 'No', 'No', 'Yes', 'No', 'Yes'],
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g']

df = pd.DataFrame(data, index=labels)
df.head(3)

       name  score  attempts qualify
a  Abhishek   20.0         1     Yes
b      Elon   18.0         1     Yes
c     Steve   10.0         2      No

**7> Write a program to select and display the 'name' and 'score' columns from the
DataFrame.**

In [15]:
# method1
name_score = df.loc[:, ['name', 'score']]
name_score

# method2
name_score1 = df[['name', 'score']]
name_score1

       name  score
a  Abhishek   20.0
b      Elon   18.0
c     Steve   10.0
d      Mark    NaN
e      Jeff   17.0
f     Roger    NaN
g       Jha   19.0

**8> Write a program to select the specified columns and rows from a given DataFrame.
<br>Select 'score' and ‘qualify’ columns in rows 1, 3, 5, 6 from the DataFrame.**

In [16]:
score_qualify = df.iloc[[1,3,5,6], [1,3]]
score_qualify

   score qualify
b   18.0     Yes
d    NaN      No
f    NaN      No
g   19.0     Yes

**9> Write a program to display the rows where the number of attempts in the examination
is greater than 2. <br>Also display the rows where the score is missing, i.e. is NaN and rows
where the score is between 15 and 20 (inclusive).**

In [17]:
df1 = df[(df['attempts'] > 2)]
df1

    name  score  attempts qualify
f  Roger    NaN         3      No

In [18]:
df2 = df[(df['score'].isnull())]
df2

    name  score  attempts qualify
d   Mark    NaN         2      No
f  Roger    NaN         3      No

In [19]:
# method1
df3 = df[(df['score'].between(15, 20))]
df3

# method2
df4 = df[(df['score'] >= 15) & (df['score'] <= 20)]
df4

       name  score  attempts qualify
a  Abhishek   20.0         1     Yes
b      Elon   18.0         1     Yes
e      Jeff   17.0         1     Yes
g       Jha   19.0         1     Yes

**10> Write a program to change the score in row 'd' to 11.5.**

In [20]:
df.loc['d', 'score'] = 11.5
df.loc['d']

name        Mark
score       11.5
attempts       2
qualify       No
Name: d, dtype: object

In [21]:
dframe = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]
})

dframe

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

**11> Write a program to identify the column(s) of a given DataFrame which have at least
one missing value.**

In [22]:
dframe.isnull().any()

ord_no          True
purch_amt      False
ord_date        True
customer_id    False
salesman_id     True
dtype: bool

**12> Write a program to count the number of missing values in each column of a given
DataFrame.**

In [23]:
print('Column      Null values')
dframe.isnull().sum()

Column      Null values

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

**13> Write a program to drop the rows and columns where at least one element is missing in
a given DataFrame.**

In [24]:
not_null = dframe.dropna()
not_null

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0  70001.0     150.50  2012-10-05         3002       5002.0
5  70005.0    2400.60  2012-07-27         3001       5001.0
8  70003.0    2480.40  2012-10-10         3003       5003.0
9  70012.0     250.45  2012-06-27         3002       5002.0

**14> Write a program to import excel data (employee.xlsx ) into a Pandas DataFrame.**

In [25]:
employees = pd.read_excel('employee.xlsx')
employees

   emp_id      name  job_experience  salary
0       1      anny            15.0  100000
1       2      sara            10.5   90000
2       3      erin             5.0   40000
3       4     celia             9.0   90000
4       5     cindy            23.0  110000
5       6    tamara             5.5   40000
6       7  phillipe            17.0  100000
7       8   charlie            13.5   85000
8       9       jim             8.0   70000
9      10       tom             9.0   70000

**15> Write a program to find the sum, mean, max, min value of 'salary' column of
employee.xlsx file.**

In [26]:
print('Details of salary column: ')
print('Sum = ', employees['salary'].sum())
print('Mean = ', employees['salary'].mean())
print('Max = ', employees['salary'].max())
print('Min = ', employees['salary'].min())

Details of salary column:
Sum =  795000
Mean =  79500.0
Max =  110000
Min =  40000

**16> Write a program to insert a column ‘mobile_no’ in the third position of the
employee.xlsx and fill it with NaN values.**

In [27]:
employees.insert(loc=2, column='mobile_no', value=np.nan)
employees

   emp_id      name  mobile_no  job_experience  salary
0       1      anny        NaN            15.0  100000
1       2      sara        NaN            10.5   90000
2       3      erin        NaN             5.0   40000
3       4     celia        NaN             9.0   90000
4       5     cindy        NaN            23.0  110000
5       6    tamara        NaN             5.5   40000
6       7  phillipe        NaN            17.0  100000
7       8   charlie        NaN            13.5   85000
8       9       jim        NaN             8.0   70000
9      10       tom        NaN             9.0   70000